Tekla.Structures.Model.ControlObjectColorEnum
The different colors used for control objects (ControlLine and ControlCircle have their own).

Tekla.Structures.Model.ControlObjectColorEnum.YELLOW_RED
The yellow/red color.

Tekla.Structures.Model.ControlObjectColorEnum.BLACK
The black color.

Tekla.Structures.Model.ControlObjectColorEnum.WHITE
The white color.

Tekla.Structures.Model.ControlObjectColorEnum.RED
The red color.

Tekla.Structures.Model.ControlObjectColorEnum.GREEN
The green color.

Tekla.Structures.Model.ControlObjectColorEnum.BLUE
The blue color.

Tekla.Structures.Model.ControlObjectColorEnum.CYAN
The cyan color.

Tekla.Structures.Model.ControlObjectColorEnum.YELLOW
The yellow color.

Tekla.Structures.Model.ControlObjectColorEnum.MAGENTA
The magenta color.